package com.zhili.zljx.test.fragment

import androidx.lifecycle.LiveData
import androidx.lifecycle.MutableLiveData
import com.zhili.zljx.bean.ErrorBean
import com.klod.base.BaseViewModel

class HomeViewModel : BaseViewModel() {

    private val _text = MutableLiveData<String>().apply {
        value = "This is home Fragment"
    }
    val text: LiveData<String> = _text

    val listData  = MutableLiveData<MutableList<ErrorBean>>().apply {
        value  = mutableListOf(
            ErrorBean(1,"1阿达色发发发福安发红包UI阿瑟发雄厚哦加工费UI回复话UK李海峰哈佛卡萨丁反馈静安寺部分就按个福建安过节费干" +
                    "于师傅暗橘色发给谁的卷发感受到附近有噶事附近高速房间爱上鼓风机安徽省附件上的交话费干啥的阿斯蒂芬阿萨德发" +
                    "于师傅暗橘色发给谁的卷发感受到附近有噶事附近高速房间爱上鼓风机安徽省附件上的交话费干啥的阿斯蒂芬阿萨德发" +
                    "于师傅暗橘色发给谁的卷发感受到附近有噶事附近高速房间爱上鼓风机安徽省附件上的交话费干啥的阿斯蒂芬阿萨德发"
                    ,false,"")
            ,ErrorBean(1,"2阿达色发发发福安发红包UI阿瑟发雄厚哦加工费UI回复话UK李海峰哈佛卡萨丁反馈静安寺部分就按个福建安过节费干" +
                    "于师傅暗橘色发给谁的卷发感受到附近有噶事附近高速房间爱上鼓风机安徽省附件上的交话费干啥的阿斯蒂芬阿萨德发" +
                    "于师傅暗橘色发给谁的卷发感受到附近有噶事附近高速房间爱上鼓风机安徽省附件上的交话费干啥的阿斯蒂芬阿萨德发" +
                    "于师傅暗橘色发给谁的卷发感受到附近有噶事附近高速房间爱上鼓风机安徽省附件上的交话费干啥的阿斯蒂芬阿萨德发"
                    ,false,"")
            ,   ErrorBean(1,"3阿达色发发发福安发红包UI阿瑟发雄厚哦加工费UI回复话UK李海峰哈佛卡萨丁反馈静安寺部分就按个福建安过节费干" +
                    "于师傅暗橘色发给谁的卷发感受到附近有噶事附近高速房间爱上鼓风机安徽省附件上的交话费干啥的阿斯蒂芬阿萨德发" +
                    "于师傅暗橘色发给谁的卷发感受到附近有噶事附近高速房间爱上鼓风机安徽省附件上的交话费干啥的阿斯蒂芬阿萨德发" +
                    "于师傅暗橘色发给谁的卷发感受到附近有噶事附近高速房间爱上鼓风机安徽省附件上的交话费干啥的阿斯蒂芬阿萨德发"
                    ,true,"")
            ,   ErrorBean(1,"4阿达色发发发福安发红包UI阿瑟发雄厚哦加工费UI回复话UK李海峰哈佛卡萨丁反馈静安寺部分就按个福建安过节费干" +
                    "于师傅暗橘色发给谁的卷发感受到附近有噶事附近高速房间爱上鼓风机安徽省附件上的交话费干啥的阿斯蒂芬阿萨德发" +
                    "于师傅暗橘色发给谁的卷发感受到附近有噶事附近高速房间爱上鼓风机安徽省附件上的交话费干啥的阿斯蒂芬阿萨德发" +
                    "于师傅暗橘色发给谁的卷发感受到附近有噶事附近高速房间爱上鼓风机安徽省附件上的交话费干啥的阿斯蒂芬阿萨德发"
                    ,true,"")
            ,   ErrorBean(1,"5阿达色发发发福安发红包UI阿瑟发雄厚哦加工费UI回复话UK李海峰哈佛卡萨丁反馈静安寺部分就按个福建安过节费干" +
                    "于师傅暗橘色发给谁的卷发感受到附近有噶事附近高速房间爱上鼓风机安徽省附件上的交话费干啥的阿斯蒂芬阿萨德发" +
                    "于师傅暗橘色发给谁的卷发感受到附近有噶事附近高速房间爱上鼓风机安徽省附件上的交话费干啥的阿斯蒂芬阿萨德发"
                    ,true,"")
            ,   ErrorBean(1,"6阿达色发发发福安发红包UI阿瑟发雄厚哦加工费UI回复话UK李海峰哈佛卡萨丁反馈静安寺部分就按个福建安过节费干" +
                    "于师傅暗橘色发给谁的卷发感受到附近有噶事附近高速房间爱上鼓风机安徽省附件上的交话费干啥的阿斯蒂芬阿萨德发" +
                    "于师傅暗橘色发给谁的卷发感受到附近有噶事附近高速房间爱上鼓风机安徽省附件上的交话费干啥的阿斯蒂芬阿萨德发" +
                    "于师傅暗橘色发给谁的卷发感受到附近有噶事附近高速房间爱上鼓风机安徽省附件上的交话费干啥的阿斯蒂芬阿萨德发"
                    ,true,"")
            ,  ErrorBean(1,"7阿达色发发发福安发红包UI阿瑟发雄厚哦加工费UI回复话UK李海峰哈佛卡萨丁反馈静安寺部分就按个福建安过节费干" +
                    "于师傅暗橘色发给谁的卷发感受到附近有噶事附近高速房间爱上鼓风机安徽省附件上的交话费干啥的阿斯蒂芬阿萨德发" +
                    "于师傅暗橘色发给谁的卷发感受到附近有噶事附近高速房间爱上鼓风机安徽省附件上的交话费干啥的阿斯蒂芬阿萨德发" +
                    "于师傅暗橘色发给谁的卷发感受到附近有噶事附近高速房间爱上鼓风机安徽省附件上的交话费干啥的阿斯蒂芬阿萨德发"
                    ,false,"")
        )
    }


    var click = 0
    fun postValueChange(p:Int){
        var list =listData.value
        list?.get(p)?.content = "点击"+click++
        listData.value = list
    }
}